In [2]:
type(str(0))

str

In [3]:
type(0)

int

In [4]:
print(int(0.5))

0

In [6]:
print(type(str(0)))

<class 'str'>

In [12]:
print("Hello" + "World")
print("Hi" * 3)
print("Hello World"[0:7]) 
print(len("Hello World"))

HelloWorld
HiHiHi
Hello W
11

In [13]:
a = 7 
print(a*3)

21

In [14]:
a = a*5 
print(a)

35

In [15]:
a=[1,2,3,4,5]
a[3]

4

In [26]:
import pandas as pd
transaction = pd.read_csv('C:/Users/chulove/Downloads/transaction.csv')

transaction

     tid  uid  product  quantity  price
0  T0001    1    lemon         5  12.40
1  T0002    5   banana         6  42.16
2  T0003    4  organge         4   6.20
3  T0003    3   cherry         3  74.40
4  T0003    3    guava         2  24.80
5  T0004    2   banana        10  42.16
6  T0004    2  organge         5   6.20
7  T0004    2    guava         2  24.80
8  T0005    5  organge         4   6.20
9  T0005    5    lemon         5  12.40

In [57]:
#判斷每一列是否含有指定字串

print(transaction['product'] == 'lemon')

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9     True
Name: product, dtype: bool

In [31]:
data = {'uid':[1,2,3,4,5],
        'name':['Howard','Lily','Kai',
                'Jojo','Ivan'],
        'age':[25,21,35,18,15]}
print('\n',(data))

print('\n',(data))

print('\n',pd.DataFrame(data))

 {'uid': [1, 2, 3, 4, 5], 'name': ['Howard', 'Lily', 'Kai', 'Jojo', 'Ivan'], 'age': [25, 21, 35, 18, 15]}

    uid    name  age
0    1  Howard   25
1    2    Lily   21
2    3     Kai   35
3    4    Jojo   18
4    5    Ivan   15

In [36]:
member = pd.DataFrame(data)
member

   uid    name  age
0    1  Howard   25
1    2    Lily   21
2    3     Kai   35
3    4    Jojo   18
4    5    Ivan   15

In [38]:
#取出資料集的開頭幾筆資料

member.head(3)

   uid    name  age
0    1  Howard   25
1    2    Lily   21
2    3     Kai   35

In [39]:
member.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   uid     5 non-null      int64
 1   name    5 non-null      object
 2   age     5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes

In [43]:
#列、欄數量

member.shape

(5, 3)

In [53]:
#取出特定欄位

print(member['name'],'\n\n')
print(member['age'])

(member)

0    Howard
1      Lily
2       Kai
3      Jojo
4      Ivan
Name: name, dtype: object


0    25
1    21
2    35
3    18
4    15
Name: age, dtype: int64

   uid    name  age
0    1  Howard   25
1    2    Lily   21
2    3     Kai   35
3    4    Jojo   18
4    5    Ivan   15

In [47]:
# 平均會員年紀
member['age'].mean()

15

In [54]:
# 最大會員年紀
member['age'].max()

35

In [48]:
member['age'].describe()

count     5.000000
mean     22.800000
std       7.758866
min      15.000000
25%      18.000000
50%      21.000000
75%      25.000000
max      35.000000
Name: age, dtype: float64

In [51]:
#1. 遞增排序

member['age'].sort_values()

print(member)

   uid    name  age
0    1  Howard   25
1    2    Lily   21
2    3     Kai   35
3    4    Jojo   18
4    5    Ivan   15

In [55]:
# 最小會員年紀
member['age'].min()

15

In [ ]:
#2. 遞減排序

member['age'].sort_values(ascending = False)

In [ ]:
#3. 單獨欄位排序

member.sort_values(['age'])

In [ ]:
#4. 移除欄位

member2 = member.drop(columns=['uid'])

In [35]:
alphabet = dict(
    a="apple",
    b="ball",
    c="cat",
    d="dog",
    e="elephant"
)

print(alphabet["a"])

alphabet["f"] = "frog" 
alphabet["a"] = "ant" 

print(alphabet["a"])
print(alphabet)

apple
ant
{'a': 'ant', 'b': 'ball', 'c': 'cat', 'd': 'dog', 'e': 'elephant', 'f': 'frog'}

In [65]:
a=[1,2,2,3,5,6,7]

a.remove(2)
a.remove(5)
a

[1, 2, 3, 6, 7]

In [63]:
member.age.tolist()

[25, 21, 35, 18, 15]